// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
// Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length >= 3) {
    console.log('великий масив, в якому 3 і більше елементи.');
} else {
    console.log('маленький масив, в якому менше 3-х елементів');
}

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//  Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
let num1 = 30;
let num2 = 30;
let num3 = 10;
if (num1 <= num2 && num1 >= num3 || num1 >= num2 && num1 <= num3) {
    console.log(num1);
} else if (num2 <= num3 && num2 >= num1 || num2 >= num3 && num2 <= num1) {
    console.log(num2);
} else if (num3 <= num1 && num3 >= num2 || num3 >= num1 && num3 <= num2) {
    console.log(num3);
}
// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
let a = 1;
let b = 2;
let result = (a + b < 4) ? 'Мало' : 'Багато';
console.log(result);

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
let number = 0;
let res = (number === 0) ? 'Нуль' : (number >= -100 && number < 0) ? 'Негативне число' : (number <= 100 && number > 0) ? 'Позитивне число': 'error';
console.log(res);


